app/controllers/archive_controller.rb

  def index
    @entres = Entre.all.group_by(&:day)
---
SELECT "entres".* FROM "entres"