app/controllers/entres_controller.rb

SELECT "entres".* FROM "entres" WHERE (created_at >='2022-10-19')
---
  def index
    @entres = Entre.where("created_at >=?", Date.today)

INSERT INTO "entres" ("meal_type", "calories", "protiens", "carbohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "breakfast"], ["calories", 200], ["protiens", 18], ["carbohydrates", 15], ["fats", 12], ["created_at", "2022-10-18 11:49:59.605698"], ["updated_at", "2022-10-18 11:49:59.605698"]]
---
  def create
    @entre = Entre.new(entre_params)

    respond_to do |format|
      if @entre.save

UPDATE "entres" SET "fats" = ?, "updated_at" = ? WHERE "entres"."id" = ?  [["fats", 53], ["updated_at", "2022-10-19 11:31:01.909305"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @entre.update(entre_params)

SELECT "entres".* FROM "entres" WHERE "entres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_entre
      @entre = Entre.find(params[:id])